//
//  RegionCodeMapper.swift
//  PetApp
//
//  Created by 정성윤 on 4/7/25.
//

import Foundation
import CoreLocation
import CoreLocation

final class RegionCodeMapper {
    static func getRegionCode(latitude: Double, longitude: Double) -> String? {
        switch (latitude, longitude) {
            // 서울특별시
        case (37.4839...37.7147, 126.8321...127.1820):
            return "6110000"
            
            // 부산광역시
        case (35.0279...35.2394, 128.8457...129.0695):
            return "6260000"
            
            // 대구광역시
        case (35.7568...35.9953, 128.4084...128.6738):
            return "6270000"
            
            // 인천광역시
        case (37.3461...37.5852, 126.5420...126.7796):
            return "6280000"
            
            // 광주광역시
        case (35.0948...35.2174, 126.7533...126.9725):
            return "6290000"
            
            // 대전광역시
        case (36.2674...36.4294, 127.3238...127.4484):
            return "6300000"
            
            // 울산광역시
        case (35.4923...35.6544, 129.2464...129.4127):
            return "6310000"
            
            // 경기도
        case (36.9893...37.7147, 126.7710...127.7796):
            return "6410000"
            
            // 강원도
        case (37.0894...38.2144, 127.3848...129.0695):
            return "6420000"
            
            // 충청북도 (세종 포함)
        case (36.4216...37.0894, 127.2174...128.2457):
            return "6430000"
            
            // 충청남도
        case (36.0474...36.9893, 126.5420...127.7796):
            return "6440000"
            
            // 전라북도
        case (35.4216...36.2674, 126.5420...127.4484):
            return "6450000"
            
            // 전라남도
        case (34.5107...35.4216, 126.2464...127.2174):
            return "6460000"
            
            // 경상북도
        case (35.7568...36.6544, 128.2457...129.4127):
            return "6470000"
            
            // 경상남도
        case (34.7568...35.4923, 127.7796...129.4127):
            return "6480000"
            
            // 제주특별자치도
        case (33.2144...33.5852, 126.1631...126.9725):
            return "6500000"
            
        default:
            return nil
        }
    }
}
